app/Controllers/Iuran.php

    public function index()
    {
        $title = "Data Iuran Warga";
        $link = "iuran";
        $model = new IuranModel();
        $iuran = $model->findAll();
---
SELECT *
FROM `iuran`

    public function autocomplete()
	{
		$query = $this->request->getVar("query");

		$builder = $this->db->table("warga");

		$builder->select('*');
		$builder->like('idWarga', $query, 'both');
        $builder->orLike('namaWarga', $query, 'both');
		$query = $builder->get();
---
SELECT *
FROM `warga`
WHERE `idWarga` LIKE '%4%' ESCAPE '!'
OR  `namaWarga` LIKE '%4%' ESCAPE '!'

    public function editiuran($idIuran)
    {
        helper(['form', 'url']);

        $title = "Edit Iuran Warga";
        $link = "iuran/edit";

        $model = new IuranModel();
        $data = array(
            'iuran' => $model->find($idIuran)
        );
---
SELECT *
FROM `iuran`
WHERE `iuran`.`idIuran` = '1'




            $IuranModel->update($idIuran, [
                'idWarga' => $this->request->getPost('idWarga'),
                'tanggal' => $tgl,
                'bulan' => $bln,
                'tahun' => $thn,
                'jumlah' => $this->request->getPost('jumlah'),
                'keterangan' => $this->request->getPost('keterangan')
            ]);
---
UPDATE `iuran` SET `idWarga` = '1', `tanggal` = '04', `bulan` = '05', `tahun` = '2022', `jumlah` = '110000', `keterangan` = 'Bayaarr April'
WHERE `iuran`.`idIuran` IN ('2')