app/Controllers/Warga.php

    public function index()
    {
        $title = "Data Warga";
        $link = "warga";
        $model = new WargaModel();
        $warga = $model->findAll();
---
SELECT *
FROM `warga`